export default {
  common: {
    metaTitle: 'А ты знаешь JavaScript?',
    metaDescription: 'Оцените уровень владения языком программирования JavaScript',
    metaKeywords: 'Тест, Тестирование, JavaScript, JS',
  },
  pages: {
    home: {
      appName: 'А ты знаешь JavaScript ?',
      appDescription: 'Изучаете JavaScript? Готовитесь к собеседованию на позицию разработчика? А может уже активно пишите на JS и желаете небольшой челлендж? Данное приложение поможет вам оценить уровень владения данным языком программирования. Вашему вниманию предоставлено более четырехсот вопросов различного уровня сложности, охватывающих все актуальные возможности текущего стандарта JS. И не беда, если некоторые вопросы ставят вас в тупик - ссылки на документацию и дополнительные материалы помогут вам понять почему JavaScript ведет себя именно так. Прокачивайте навыки владения JS. Пишите хороший код. Не останавливайтесь на достигнутом.',
    },
  },
  components: {
    startButton: {
      mainLabel: 'Начать тестирование',
      waitingLabel: 'Подготовка вопросов',
      errorLabel: 'Ошибка. Код ошибки 1',
    },
    addQuestion: {
      header: 'Добавить вопрос',
      annotation: 'У вас есть хороший пример вопроса, которого вы не нашли в данном приложении? Пожалуйста, поделитесь им с сообществом.',
      button: 'Добавить',
    },
    appSettings: {
      header: 'Настройки приложения',
      annotation: 'Выбор языка приложения и темы оформления',
      buttons: {
        light: 'Дневной',
        dark: 'Ночной',
      },
    },
    footer: {
      writeMeButton: 'Написать автору',
      policyButton: 'Политика конфеденциальности',
      copyright: '© 2020 - 2020 Кинеев Алексей',
    },
  },
  elements: {},
};
