export default {
  common: {
    metaTitle: 'А ты знаешь JavaScript?',
    metaDescription: 'Оцените уровень владения языком программирования JavaScript',
    metaKeywords: 'Тест, Тестирование, JavaScript, JS',
  },
  pages: {
    home: {
      appName: 'А ты знаешь JavaScript ?',
      appDescription: 'Изучаете JavaScript? Готовитесь к собеседованию на позицию разработчика? А может уже активно пишите на JS и желаете небольшой челлендж? Данное приложение поможет вам оценить уровень владения данным языком программирования. Вашему вниманию предоставлено более четырехсот вопросов различного уровня сложности, охватывающих все актуальные возможности текущего стандарта JS. И не беда, если некоторые вопросы ставят вас в тупик - ссылки на документацию и дополнительные материалы помогут вам понять почему JavaScript ведет себя именно так. Прокачивайте навыки владения JS. Пишите хороший код. Не останавливайтесь на достигнутом.',
    },
  },
  components: {},
  elements: {},
};
